# RbsFamilyContentDistributionSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFamilyContentDistributionSystem Property
ParameterTypeId Class See Also
---
"Distribution System"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFamilyContentDistributionSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFamilyContentDistributionSystem As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFamilyContentDistributionSystem {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace